[
    {
        "data": {
            "recordPageView": {
                "__typename": "PageViewSummary",
                "totalCount": 270
            }
        }
    },
    {
        "data": {
            "employerReviews": {
                "__typename": "EmployerReviewsRG",
                "allReviewsCount": 5923,
                "currentPage": 269,
                "filteredReviewsCount": 4303,
                "lastReviewDateTime": "2025-04-16T19:49:30.097",
                "numberOfPages": 431,
                "queryJobTitle": null,
                "queryLocation": null,
                "ratedReviewsCount": 4826,
                "ratingCountDistribution": {
                    "__typename": "RatingCountDistribution",
                    "careerOpportunities": {
                        "_1": 687,
                        "_2": 624,
                        "_3": 953,
                        "_4": 951,
                        "_5": 849,
                        "__typename": "FiveStarRatingCountDistribution"
                    },
                    "compensationAndBenefits": {
                        "_1": 861,
                        "_2": 854,
                        "_3": 1134,
                        "_4": 764,
                        "_5": 439,
                        "__typename": "FiveStarRatingCountDistribution"
                    },
                    "cultureAndValues": {
                        "_1": 550,
                        "_2": 382,
                        "_3": 680,
                        "_4": 875,
                        "_5": 1508,
                        "__typename": "FiveStarRatingCountDistribution"
                    },
                    "diversityAndInclusion": {
                        "_1": 239,
                        "_2": 141,
                        "_3": 320,
                        "_4": 474,
                        "_5": 754,
                        "__typename": "FiveStarRatingCountDistribution"
                    },
                    "overall": {
                        "_1": 593,
                        "_2": 616,
                        "_3": 1129,
                        "_4": 1369,
                        "_5": 1105,
                        "__typename": "FiveStarRatingCountDistribution"
                    },
                    "recommendToFriend": {
                        "RECOMMEND": 2123,
                        "WONT_RECOMMEND": 1390,
                        "__typename": "RecommendToFriendRatingCountDistribution"
                    },
                    "seniorManagement": {
                        "_1": 879,
                        "_2": 589,
                        "_3": 852,
                        "_4": 888,
                        "_5": 763,
                        "__typename": "FiveStarRatingCountDistribution"
                    },
                    "workLifeBalance": {
                        "_1": 768,
                        "_2": 624,
                        "_3": 898,
                        "_4": 900,
                        "_5": 853,
                        "__typename": "FiveStarRatingCountDistribution"
                    }
                },
                "ratings": {
                    "__typename": "EmployerRatings",
                    "businessOutlookRating": 0.49,
                    "careerOpportunitiesRating": 3.2,
                    "ceoRating": 0.69,
                    "compensationAndBenefitsRating": 2.9,
                    "cultureAndValuesRating": 3.6,
                    "diversityAndInclusionRating": 3.8,
                    "overallRating": 3.4,
                    "ratedCeo": {
                        "__typename": "Ceo",
                        "id": 250182,
                        "largePhoto": "https://media.glassdoor.com/people/sqll/335551/ef-education-first-ceo1648550297076.png",
                        "name": "Edward Hult, Ph.D",
                        "regularPhoto": "https://media.glassdoor.com/people/sql/335551/ef-education-first-ceo1648550297076.png",
                        "title": "CEO "
                    },
                    "recommendToFriendRating": 0.61,
                    "reviewCount": 4817,
                    "seniorManagementRating": 3.1,
                    "workLifeBalanceRating": 3.2
                },
                "reviews": [
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "- Listen to your staff and make them feel that what they do matters. It's easy to complain about teachers leaving, but management are not truly addressing the causes.\r\n\r\n- Offer more options for qualifications. If you want employees to stay with the company and progress, they need options that suit them.\r\n\r\n- Neutralize toxicity in the workplace.\r\n\r\n- Be honest with people during the interview stage. Many arrive expecting a traditional classroom environment rather than an ESL model. Let teachers know that they will also be expected to market the products. Furthermore, if you want serious applicants who will stay with the company and actually work hard, stop advertising the job as a holiday job! Too many lazy people are hired just to fill spaces who end up leaving after 4-5 months. Please be honest with potential teachers.",
                        "adviceOriginal": null,
                        "cons": "- In two years with the company, I was only appraised once. Appraisals should be held in your 5th and 11th months of your contract. Your line manager is under an enormous amount of pressure (or completely incompetent) and will find it difficult to stick to this time frame.\r\n\r\n- No HR department. One bad apple in the office will spoil the entire workplace, but there's no one trained to do anything about them. My second year was spoiled by an office bully who drained the atmosphere in the office.\r\n\r\n- Professional development is limited to bi-monthly workshops. Often, these workshops are led by senior teachers who would rather be doing anything else. They are a waste of time that nobody benefits from. Skills are taught through \"IknowEF\", a website with a comprehensive library of things you need to know to be an EF teacher, but is completely unhelpful outside of EF.\r\n\r\n- Taking another job in China is a nightmare caused by a vindictive policy of punishing employees and general incompetence of the company's visa department. Even if you finish your contract and are a model employee, you will be subjected to the same tactics. Your work permit and residency permit will be cancelled, even though it is legal to transfer the work permit to your new employer. They will then conveniently fail to produce your exit papers on time, even though you need them to start the work permit process again. Once you leave the company, they will make it as difficult as possible for you to remain in China or get another job and they will offer no assistance to you as you no longer work for them. \r\n\r\n- The company recently started pushing employees to get a certTESOL if you want to progress beyond senior teacher. However, you are not given a lot of windows to get one. Course spaces provided by EF are limited to the point where they had to reject a lot of applicants. Those wanting to take leave to do an intensive course are told that they need to use their annual leave/take unpaid leave while they do so.",
                        "consOriginal": null,
                        "countHelpful": 4,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": false,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 42779,
                            "text": "ESL Teacher"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 2,
                        "location": {
                            "__typename": "City",
                            "id": 2365108,
                            "name": "Guangzhou, Guangdong",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "- Onboarding and arrival help was good when I arrived in 2016. Hotel is paid for and an agent is hired to help you find an apartment. The onboarding training and set up was quick but thorough. Everything is taken care of by the company.\r\n\r\n- All you need is a bachelors degree to be hired. If you are someone who wants to try the ESL industry for a year to see if this style of teaching is for you, it's very easy to get hired. Teaching qualifications and courses are offered by the company to improve your teaching and CV.\r\n\r\n- For the most part, EF staff became like a family to me. I became friendly with teachers from across the city and we often hung out. Staff in my school were really cool and helpful.\r\n\r\n- People are promoted super fast here. If you stick around for longer than a year and you get stuck in, chances are you'll move up to senior teacher. If you have a CertTESOL/CELTA and have been with the company for more than two years, you'll have a shot at Director of Studies or maybe you'll move to another department depending on your skill set.\r\n\r\n- The hours are good. If you are organised, you'll often find that you have plenty of time on your hands. plan all your lessons in one day and get your admin work out of the way early and you can concentrate on whatever you want.\r\n\r\n- The kids are awesome. You'll learn a lot about how to interact with kids and teens, how to manage a classroom and how to teach.",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "NEGATIVE",
                        "ratingCareerOpportunities": 4.0,
                        "ratingCeo": "NO_OPINION",
                        "ratingCompensationAndBenefits": 2.0,
                        "ratingCultureAndValues": 2,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 3,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 1.0,
                        "ratingWorkLifeBalance": 4.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2018-01-16T21:55:52.643",
                        "reviewId": 18767864,
                        "summary": "An Honest Review",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "- Get a proper HR department. \r\n- Train your managers. Half of them know less than the employees they're supposed to be managing. \r\n- Pay your employees what they're worth. What you pay in Switzerland is below the country's poverty line.\r\n- Stop trying to hire \"cheap\" labor with this messy and unethical contractor system. \r\n- Understand that you can throw all the themed prosecco parties you want to and give us another movie room, but it doesn't make up for disrespecting your staff or allowing toxic environments to form. \r\n- Deliver what you promise and stop overselling to both customers and your own staff! Do better.",
                        "adviceOriginal": null,
                        "cons": "- The pay is so bad compared to industry and local standards, it skates the line between \"unethical\" and \"barely legal\". If they can get you in the door for minimum wage, they will.\r\n- Contract work is the name of the game for this company. They will bring in employees with outstanding work history, high levels of education and expertise, and genuine talent and they will force them to work under untrained supervisors and managers with no clear vision or use for their talent. It's very frustrating and makes this a hard company for professionals looking for more than that \"first job feeling\". \r\n- Management undergoes no formal training. You take a hard gamble here because depending on who your manager is, it can become one of the most toxic working environments of your career.   \r\n- THERE IS NO HR. Something I wasn't aware of when I got into this is that there's no real HR. Sure, there's a team to manage recruitment and payroll, but if you ever have a real problem at work, you're on your own. If you're unlucky enough to get stuck under a bad manager, you're forced to sort it out yourself and either risk losing your job or just grin and take it until you burn out or manage to find another position within the company. If you do manage to get through to your manager about an issue, it is rare that anything actually changes. \r\nYou also face inappropriate conversations that fall into a grey area where the person saying the explicit or prejudiced thing just gets away with it. One that's stuck with me was when a manager told another employee, \"You're from ______, so of course your idea for this is going to be tackier than someone from Western Europe.\" \r\n- Nepotism is a problem. It's an open secret that everyone just sort of deals with. \r\n- There are serious limitations on promotions and salary increases. You learn not to believe anything your manager promises in an evaluation. \r\n- Promises aren't kept and there's no structure for followthrough. You'll be told your job involves one thing and then actually be made to do another. If you ask to speak about it, you're condescendingly reminded of the principle that we're not a \"not my job\" company and told to take it on the chin. \r\n- You could work two hours of overtime every single day and nobody will compensate it or care. \r\n- Vision changes every few months. It's very jarring to keep up with, especially if you have a lot of responsibility. Sometimes it feels like you have a different priority every single week and it's hard to value anything you're working on because even mid-way through an assignment, it could be scrapped entirely.\r\n- High rate of turnover. Some of this is because of the short contracts given to perfectly skilled and deserving employees (who might be forced right out the door once their contract expires). But most of it is because of what's been listed above. This is a hard company to stay loyal to past a certain point. \r\n- Finally, management is never accountable for anything.",
                        "consOriginal": null,
                        "countHelpful": 4,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [
                            {
                                "__typename": "EmployerResponse",
                                "countHelpful": 0,
                                "countNotHelpful": 0,
                                "id": 2101368,
                                "languageId": "eng",
                                "originalLanguageId": null,
                                "response": "We are very sorry to read about your negative experience. The unique culture at EF, including our entrepreneurial spirit and benefits, as well as the high quality of our management, its practices, and training, are a big attraction for our employees and prospective talent. Having such a strong culture, we know that we are not the best fit for everyone, and we regret that these qualities were not a fit for you.  Thank you for your feedback and best of luck in your next opportunity.",
                                "responseDateTime": "2019-05-28T01:26:15.577",
                                "responseOriginal": null,
                                "translationMethod": null
                            }
                        ],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": false,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 12900,
                            "text": "Marketer"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 4,
                        "location": {
                            "__typename": "City",
                            "id": 3297851,
                            "name": "Zürich",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "- You landed a job. Hooray!\r\n- The people are amazing. They're some of the most interesting, hard-working, and friendly I've ever worked with. Your awesome colleagues will keep you sane and motivated.\r\n- You have the opportunity to travel and connect with other EF employees all over the world. \r\n- Happy hours and social events.\r\n- The idea of what EF is doing is fantastic. You'll feel really good when you hear positive feedback from happy customers who've learned or experienced something valuable through an EF program. \r\n- Beautiful location",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "NEUTRAL",
                        "ratingCareerOpportunities": 3.0,
                        "ratingCeo": "NO_OPINION",
                        "ratingCompensationAndBenefits": 2.0,
                        "ratingCultureAndValues": 3,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 3,
                        "ratingRecommendToFriend": "NEGATIVE",
                        "ratingSeniorLeadership": 3.0,
                        "ratingWorkLifeBalance": 2.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2019-05-11T08:17:53.400",
                        "reviewId": 26092875,
                        "summary": "Be careful",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "Invest more resources on your team leaders, only this way you'll be able to retain some of your employees for longer than 1 year\r\n\r\nImprove your internal communication and treat your employees as adults, not children.",
                        "adviceOriginal": null,
                        "cons": "- Most of the people are internally recruited\r\n- Everything works with internal networking - either you are a friend or your request can wait\r\n- Team managers tend to be quite inexperienced, especially in digital marketing. They are very good with numbers, but have no clue on how to manage, train and coach people. \r\n- There is a major lack of internal communication",
                        "consOriginal": null,
                        "countHelpful": 5,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": false,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 12906,
                            "text": "Marketing"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 1,
                        "location": {
                            "__typename": "City",
                            "id": 3297021,
                            "name": "Lucerne",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "Easy to get in\r\nIdeal as a first job - it looks good on CV\r\nGreat job titles (everybody seems to be a manager)\r\nRelaxed work environment",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "NEUTRAL",
                        "ratingCareerOpportunities": 4.0,
                        "ratingCeo": null,
                        "ratingCompensationAndBenefits": 2.0,
                        "ratingCultureAndValues": 2,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 1,
                        "ratingRecommendToFriend": "NEGATIVE",
                        "ratingSeniorLeadership": 1.0,
                        "ratingWorkLifeBalance": 4.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2013-04-24T02:35:36.957",
                        "reviewId": 2589397,
                        "summary": "Very young team, trying hard, but without any people management knowledge. Ideal only as a first job",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "Improve infrastructure and become even more agile",
                        "adviceOriginal": null,
                        "cons": "Some issues with infrastructure and a rather small company in comparison with the rest of EF however has the support from a very big and experienced enterprise.",
                        "consOriginal": null,
                        "countHelpful": 2,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": true,
                        "jobTitle": null,
                        "languageId": "eng",
                        "lengthOfEmployment": 2,
                        "location": {
                            "__typename": "City",
                            "id": 2671300,
                            "name": "London, England",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "It's a very entrepreneurial company with ambitious people and great colleagues. It feels like you're in the frontier of your work and that everybody want to constantly push forward and evolve both as a company and regarding customer service and the product we provide. The industry is fast growing which makes the future look bright.",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "POSITIVE",
                        "ratingCareerOpportunities": 5.0,
                        "ratingCeo": null,
                        "ratingCompensationAndBenefits": 4.0,
                        "ratingCultureAndValues": 5,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 4,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 4.0,
                        "ratingWorkLifeBalance": 3.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2013-10-02T01:48:46.740",
                        "reviewId": 3125668,
                        "summary": "EF Englishtown - small but ambitious with great outlook in an interesting industry",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "Top management should try to know the individual efforts and should stop giving importance only to the leads they love and neglecting the other team members is really disgusting. which made me pissed of whole my career in EF.",
                        "adviceOriginal": null,
                        "cons": "I had worked more than 3.5 yers in this company, Top management should try to know the individual efforts and should stop giving importance only to the leads they love and neglecting the other team members is really disgusting.",
                        "consOriginal": null,
                        "countHelpful": 1,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": null,
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": false,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 14318,
                            "text": "UI Designer"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 0,
                        "location": {
                            "__typename": "City",
                            "id": 2940587,
                            "name": "Bengaluru",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "It was a good experience working with EF, Competitive hike in salary, Good work culture and and easily accessible as it is in the heart of the city.",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "POSITIVE",
                        "ratingCareerOpportunities": 2.0,
                        "ratingCeo": "NO_OPINION",
                        "ratingCompensationAndBenefits": 4.0,
                        "ratingCultureAndValues": 3,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 3,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 1.0,
                        "ratingWorkLifeBalance": 3.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2016-04-06T20:55:30.323",
                        "reviewId": 10183587,
                        "summary": "Great Company!!",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "Work on employee retention. A lot of value gets lost due to high turnover.",
                        "adviceOriginal": null,
                        "cons": "Little option to develop yourself. The strategy seems to hire young people (especially in sales) who work hard and cost little. I was one of the lucky ones to make a career step, but most people leave after 2-3 years due to long working hours, low salaries and lack of development options.",
                        "consOriginal": null,
                        "countHelpful": 1,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": true,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 12906,
                            "text": "Marketing"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 9,
                        "location": {
                            "__typename": "City",
                            "id": 3297021,
                            "name": "Lucerne",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "Lots of possibilities to learn, although it is learning by doing, with little training. Great atmosphere with fun people, very international, real community feeling. Great product to work for (international travel and education)",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "POSITIVE",
                        "ratingCareerOpportunities": 2.0,
                        "ratingCeo": "NO_OPINION",
                        "ratingCompensationAndBenefits": 1.0,
                        "ratingCultureAndValues": 4,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 4,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 1.0,
                        "ratingWorkLifeBalance": 3.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2018-01-03T06:43:33.230",
                        "reviewId": 18557182,
                        "summary": "Great place to work for young people",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "Treat all staff equally and fairly, don't agree to look after staff and then take away help when they can't reentre the county due to the border being closed.",
                        "adviceOriginal": null,
                        "cons": "1. Pay - Pay package is poor compared to other schools, I'd advise going for an international school rather than training centres like  EF. \n\n2. Pressure and blackmail from management - As soon as I left China, was forgotten about and forced to give up my holiday, as my manager said if I didn't give it up, they might not be able to \"arrange\" online classes for me. Felt like blackmail if I'm honest, but I wanted to get paid so gave up my holiday ( in hindsight, I shouldn't have).\n\n3.  Change in contract - As well as being put under a lot of pressure once I left China,  such as having to do online classes at 2am even though I asked for them to be rescheduled , and having to give up my holiday, also had the contract changed with just a few days notice - the contract was as follows:\n-  chinese minimum wage (£200 a month) from £10,500, for the same amount of work. \n- no holiday pay.\n- no flight and they stopped paying for my apartment in China. \n- agree to \"make up\" on time spent out of china.\nDue to the company not even paying me enough to even pay my rent, I decided it was best to leave.  They said they changed the contract as I couldn't return to China as the border was closed. \n\n4. Preferential treatment - \nThey tried to keep me on by saying we were \"family\" but what kind of family, gives a paycut to half their staff.  Both the foreign staff outside of China were forced to take a paycut, and the local Chinese staff were forced to take 2 pay cuts while the foreign staff still in China got bonuses . That seems fair, doesn't it. \n\n5. Poor response from management: \nWhen I and my fellow staff complained, we were told it was our fault for leaving China. When we mentioned the disparity between staff outside of China, Chinese staff and foreign staff still in China, were told that we \"shouldn't be discussing wages, if we hear you do it again you will be fired.\" Clearly, instead of listening to us, management tried to scare us into accepting their poor treatment.",
                        "consOriginal": null,
                        "countHelpful": 6,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [
                            {
                                "__typename": "EmployerResponse",
                                "countHelpful": 0,
                                "countNotHelpful": 0,
                                "id": 2736464,
                                "languageId": "eng",
                                "originalLanguageId": null,
                                "response": "Thank you for your review. We're glad you were able to work with a supportive staff and that detailed training was provided. We would agree that the events and activities organized make the environment fun for our staff. Like many companies, we had to adapt and make some changes due to COVID, however we are concerned about the treatment and communication described in your post. Please send us a detailed email to teacher.welfare@ef.com so we can look into the matter.",
                                "responseDateTime": "2020-08-27T03:01:46.043",
                                "responseOriginal": null,
                                "translationMethod": null
                            }
                        ],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": false,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 20246,
                            "text": "Teacher"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 2,
                        "location": {
                            "__typename": "City",
                            "id": 2459338,
                            "name": "Hangzhou, Zhejiang",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "1. The training is detailed. \n2. Staff are supportive \n3. Flights and accommodation paid for. \n4. Fun events/ activities organised.",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "NEGATIVE",
                        "ratingCareerOpportunities": 3.0,
                        "ratingCeo": "DISAPPROVE",
                        "ratingCompensationAndBenefits": 1.0,
                        "ratingCultureAndValues": 1,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 2,
                        "ratingRecommendToFriend": "NEGATIVE",
                        "ratingSeniorLeadership": 1.0,
                        "ratingWorkLifeBalance": 3.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2020-08-22T07:46:25.353",
                        "reviewId": 35167552,
                        "summary": "Worked in Hangzhou,  once I left China due to Covid, EF stopped caring about me even though I worked full  time online.",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": null,
                        "adviceOriginal": null,
                        "cons": "Sometimes deadlines are tight and you need to work pretty hard, but...which company does not have this?",
                        "consOriginal": null,
                        "countHelpful": 0,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": true,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 62731,
                            "text": "Business Analyst"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 1,
                        "location": null,
                        "originalLanguageId": null,
                        "pros": "EF has so many offices all over the world - you can work in so many different countries!\r\nGreat opportunities to rotate and change roles in different departments, and grow professionally.\r\nSuper good atmosphere at the office, and offices have really nice decoration.\r\nGood salary and conditions.\r\nChallenging and interesting projects, that promotes interaction in between different colleagues, teams, and with other offices around the world. \r\n\r\nWorking for them, and the atmosphere, people...it's just FUN, makes you enjoy what you are doing and makes you love your job!",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "POSITIVE",
                        "ratingCareerOpportunities": 5.0,
                        "ratingCeo": null,
                        "ratingCompensationAndBenefits": 4.0,
                        "ratingCultureAndValues": 5,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 5,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 4.0,
                        "ratingWorkLifeBalance": 3.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2013-02-13T10:30:29.633",
                        "reviewId": 2366376,
                        "summary": "A super good company to work for!!",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "Hiring and expanding from within would be much better than hiring from out of sector professionals to mid and higher management. \r\n\r\nMoney attracts money therefore instead of trying to be more cost effective, attempting to go big and spend a bit would help more than hurt the brand and image of the company",
                        "adviceOriginal": null,
                        "cons": "Too much of an amatuer spirit that cuts in the way of expanding and creating the global brand on a local scale.",
                        "consOriginal": null,
                        "countHelpful": 1,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": true,
                        "jobTitle": null,
                        "languageId": "eng",
                        "lengthOfEmployment": 1,
                        "location": null,
                        "originalLanguageId": null,
                        "pros": "A very international company in its own rights, good pay and the opportunity to work and experience the education management industry in a diverse way",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "NEUTRAL",
                        "ratingCareerOpportunities": 3.0,
                        "ratingCeo": null,
                        "ratingCompensationAndBenefits": 4.0,
                        "ratingCultureAndValues": 3,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 3,
                        "ratingRecommendToFriend": "NEGATIVE",
                        "ratingSeniorLeadership": 3.0,
                        "ratingWorkLifeBalance": 4.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2013-09-04T23:54:16.707",
                        "reviewId": 3013865,
                        "summary": "A Global company with a local perspective",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": null,
                        "adviceOriginal": null,
                        "cons": "Sometimes the company seems too interested in making profit rather than academic focus, but this seems somewhat reasonable due to the company relying on customer profit to stay in business.",
                        "consOriginal": null,
                        "countHelpful": 0,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": false,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 3566360,
                            "text": "International ESL Teacher"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 2,
                        "location": {
                            "__typename": "City",
                            "id": 2478891,
                            "name": "Wuhan, Hubei",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "Overall I have had a positive experience working at EF Wuhan. Visa support and housing is always to an excellent standard, the salary is pretty good for the city and there are good bonus opportunities throughout the year. There is a lot of support for teachers working in the city in terms of training and development and the school is an attractive place to work with plenty of materials to make a teacher’s job easy.",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": null,
                        "ratingCareerOpportunities": 5.0,
                        "ratingCeo": "APPROVE",
                        "ratingCompensationAndBenefits": 5.0,
                        "ratingCultureAndValues": 5,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 5,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 5.0,
                        "ratingWorkLifeBalance": 5.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2017-11-28T01:02:46.347",
                        "reviewId": 18091576,
                        "summary": "Full time teacher",
                        "summaryOriginal": null,
                        "translationMethod": null
                    }
                ]
            }
        }
    }
]