[
    {
        "data": {
            "recordPageView": {
                "__typename": "PageViewSummary",
                "totalCount": 65
            }
        }
    },
    {
        "data": {
            "employerReviews": {
                "__typename": "EmployerReviewsRG",
                "allReviewsCount": 5923,
                "currentPage": 64,
                "filteredReviewsCount": 4303,
                "lastReviewDateTime": "2025-04-16T19:49:30.097",
                "numberOfPages": 431,
                "queryJobTitle": null,
                "queryLocation": null,
                "ratedReviewsCount": 4826,
                "ratingCountDistribution": {
                    "__typename": "RatingCountDistribution",
                    "careerOpportunities": {
                        "_1": 687,
                        "_2": 624,
                        "_3": 953,
                        "_4": 951,
                        "_5": 849,
                        "__typename": "FiveStarRatingCountDistribution"
                    },
                    "compensationAndBenefits": {
                        "_1": 861,
                        "_2": 854,
                        "_3": 1134,
                        "_4": 764,
                        "_5": 439,
                        "__typename": "FiveStarRatingCountDistribution"
                    },
                    "cultureAndValues": {
                        "_1": 550,
                        "_2": 382,
                        "_3": 680,
                        "_4": 875,
                        "_5": 1508,
                        "__typename": "FiveStarRatingCountDistribution"
                    },
                    "diversityAndInclusion": {
                        "_1": 239,
                        "_2": 141,
                        "_3": 320,
                        "_4": 474,
                        "_5": 754,
                        "__typename": "FiveStarRatingCountDistribution"
                    },
                    "overall": {
                        "_1": 593,
                        "_2": 616,
                        "_3": 1129,
                        "_4": 1369,
                        "_5": 1105,
                        "__typename": "FiveStarRatingCountDistribution"
                    },
                    "recommendToFriend": {
                        "RECOMMEND": 2123,
                        "WONT_RECOMMEND": 1390,
                        "__typename": "RecommendToFriendRatingCountDistribution"
                    },
                    "seniorManagement": {
                        "_1": 879,
                        "_2": 589,
                        "_3": 852,
                        "_4": 888,
                        "_5": 763,
                        "__typename": "FiveStarRatingCountDistribution"
                    },
                    "workLifeBalance": {
                        "_1": 768,
                        "_2": 624,
                        "_3": 898,
                        "_4": 900,
                        "_5": 853,
                        "__typename": "FiveStarRatingCountDistribution"
                    }
                },
                "ratings": {
                    "__typename": "EmployerRatings",
                    "businessOutlookRating": 0.49,
                    "careerOpportunitiesRating": 3.2,
                    "ceoRating": 0.69,
                    "compensationAndBenefitsRating": 2.9,
                    "cultureAndValuesRating": 3.6,
                    "diversityAndInclusionRating": 3.8,
                    "overallRating": 3.4,
                    "ratedCeo": {
                        "__typename": "Ceo",
                        "id": 250182,
                        "largePhoto": "https://media.glassdoor.com/people/sqll/335551/ef-education-first-ceo1648550297076.png",
                        "name": "Edward Hult, Ph.D",
                        "regularPhoto": "https://media.glassdoor.com/people/sql/335551/ef-education-first-ceo1648550297076.png",
                        "title": "CEO "
                    },
                    "recommendToFriendRating": 0.61,
                    "reviewCount": 4817,
                    "seniorManagementRating": 3.1,
                    "workLifeBalanceRating": 3.2
                },
                "reviews": [
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": null,
                        "adviceOriginal": null,
                        "cons": "-Management. Poor management is a clear trend in these reviews--I wish I had paid more attention to them when I was interviewing. A lack of effective managers and management experience is my chief complaint. Management positions are filled internally when it doesn't even make sense. I am often in dismay at the lack of professionalism management exhibits or excuses here. I think they get away with a lot by mostly managing young, entry level post-grads. It's a strange power dynamic.\r\n-If diversity is important to you, this probably isn't the right workplace environment for you. On top of a lack of surface level diversity, the workforce is painfully homogeneous; it's a perfect example of a company that says they are always striving to increase diversity in hiring, yet somehow also seems to constantly prioritize the notion of \"culture fit\" without realizing their culture may be running counterintuitive to their goals to diversify the workforce. There are people who really care and put on incredible diversity events, but the participants are those who need diversity training least: mostly those who already identify within a minority group.\r\n-Lack of career direction or definition. Modest annual raises and no additional compensation opportunities. \r\n-No flexible work policy. At best, EF is way behind the times here. At worst, they don't trust their employees.",
                        "consOriginal": null,
                        "countHelpful": 6,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [
                            {
                                "__typename": "EmployerResponse",
                                "countHelpful": 0,
                                "countNotHelpful": 0,
                                "id": 2575508,
                                "languageId": "eng",
                                "originalLanguageId": null,
                                "response": "Thank you for your feedback. We always want to improve and your comments are valuable for our efforts in this matter. We are happy to hear you enjoy some of the perks of joining EF - the travel, the fun factor this company has to offer in terms of fun events etc and working in a highly international environment together with fun and outgoing colleagues. \n\n We are sorry to hear you perceive a lack of management and career direction. We take professional development seriously and, with the number of schools and offices around the world, we're sorry to see that you found mobility to be a challenge. \nIn terms of diversity, we believe we are truly diverse as a company. In many of our offices around the globe, we have many different nationalities. For example in Zurich with 700 people, we have 47 different nationalities. \n\nIf you wish to discuss more flexible working hours, please contact your local RED team. Best regards",
                                "responseDateTime": "2020-03-30T06:12:16.713",
                                "responseOriginal": null,
                                "translationMethod": null
                            }
                        ],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": true,
                        "jobTitle": null,
                        "languageId": "eng",
                        "lengthOfEmployment": 4,
                        "location": {
                            "__typename": "City",
                            "id": 1154532,
                            "name": "Boston, MA",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "-Incredible travel perks.\r\n-Incredible end-product.\r\n-Pay is good for non-entry level positions.\r\n-Incredible benefits.\r\n-Feels like a transition out of college if you're into that???\r\n-There are a lot of fun events and feel-good surprises for employees. While these are a wholly positive on their own, most anyone I've spoken to would gladly sacrifice these for even a tiny annual bonus. It makes you feel like the company prioritizes how it looks externally to what it puts in its employees' pockets esp. since it's well known entry-level jobs pay poorly and EF flaunts its $$$.",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "NEGATIVE",
                        "ratingCareerOpportunities": 2.0,
                        "ratingCeo": "NO_OPINION",
                        "ratingCompensationAndBenefits": 5.0,
                        "ratingCultureAndValues": 3,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 3,
                        "ratingRecommendToFriend": "NEGATIVE",
                        "ratingSeniorLeadership": 2.0,
                        "ratingWorkLifeBalance": 4.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2020-03-24T07:39:27.867",
                        "reviewId": 32470769,
                        "summary": "A Specific Type of Person Will Thrive Here",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": null,
                        "adviceOriginal": null,
                        "cons": "I came to EF because it was a brand I knew and loved. Under the surface I felt like they didn't always do right by their employees and customers.\r\n\r\n1. They promise bonuses as if they're basically a given. I was a top performer and struggled to hit goals a lot of months because of the aggressive nature of them. \r\n2. Also regarding pay, it's so low. It's ridiculous to be living in Denver and being paid half of what your fellow sales people are at different companies. Especially when getting the bonuses isn't as easy as initially promised.\r\n3. There is NO room for upward mobility. They act like they're grooming you to work at EF forever, which a lot of people want, but only 1-2 roles open up per year and they're usually sales related and 15-20 people are interested in it. More centralized roles need to be moved to Denver in order to keep top talent within the company.\r\n4. Most notably, and probably one of the last straws before I left, was the carelessness of our CEO. The way he handled COVID, BLM, and so many other challenges to the business showed me and many others in our company he genuinely did not care about us or his customers. He is condescending, and quite frankly it never feels like he wants to be speaking to us. I would describe his behavior as if he never really wanted to inherit the CEO responsibilities from his father who started the company.",
                        "consOriginal": null,
                        "countHelpful": 6,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [
                            {
                                "__typename": "EmployerResponse",
                                "countHelpful": 0,
                                "countNotHelpful": 0,
                                "id": 2956585,
                                "languageId": "eng",
                                "originalLanguageId": null,
                                "response": "Thank you for your detailed feedback. It’s great to hear about your experience with our training program and career development, and I’m so glad you enjoyed all your opportunities to travel. We are all looking forward to the days when travel is a big part of EF life again. You’ve also provided some very valuable constructive feedback that we will certainly reflect on in our continual effort to improve. \nThis has been a very difficult year for people and organizations around the world, and remote communication hasn't made it easier for anyone. I'm sorry to hear that you came away from such a difficult time with negative feelings about EF. I can reassure you that our leadership team has had customers and employees at the forefront of every decision. Our CEO shared his thoughts about racial injustice in this letter: https://www.ef.com/wwen/blog/we-are-ef/a-letter-from-our-ceo-of-north-america/",
                                "responseDateTime": "2021-01-19T13:07:19.43",
                                "responseOriginal": null,
                                "translationMethod": null
                            }
                        ],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": false,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 35235,
                            "text": "Senior Territory Manager"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 4,
                        "location": {
                            "__typename": "City",
                            "id": 1148170,
                            "name": "Denver, CO",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "I started at EF right out of college and there were some things they did really well:\r\n\r\n1. Incredible sales training program, a 1 month incubator style format\r\n2. Exciting milestones to feel like you're working towards a real career\r\n3. A lot of opportunities to get involved and learn a lot in your early career days\r\n4. Travel (pre-COVID)",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": null,
                        "ratingCareerOpportunities": 1.0,
                        "ratingCeo": "DISAPPROVE",
                        "ratingCompensationAndBenefits": 2.0,
                        "ratingCultureAndValues": 3,
                        "ratingDiversityAndInclusion": 1,
                        "ratingOverall": 3,
                        "ratingRecommendToFriend": null,
                        "ratingSeniorLeadership": 5.0,
                        "ratingWorkLifeBalance": 4.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2020-12-17T13:36:48.270",
                        "reviewId": 39573064,
                        "summary": "Good first job overall",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "-Find ways to take some of the workloads off TCs’ plates. Allow them to focus more on selling and less on the account management pieces OR put bonus potential on the acct mgmt so the pay is split accordingly to the work.\r\n-It is lackluster to say how much you care about employees when there is no plan to raise their salaries or keep them from leaving. If your business plan doesn’t focus on retaining employees, that’s fine, but own it. People regret sticking around for empty promises and leave with a bad taste in their mouths.\r\n-A lot of time is spent caring so much for customers, yet EF fails to care for employees. EF works so hard to make customers happy, yet customers’ #1 complaint is the turnover rate of TCs… wouldn’t it make sense to focus on keeping employees which inherently ensures a better customer experience?",
                        "adviceOriginal": null,
                        "cons": "-Turnover is astronomically high. Many reasons being pay, but particularly in Denver, once you become a Senior TC, you have basically climbed the ladder. Unless you are willing to relocate, you have no room for growth in the Den office. If you want to stay a TC, there are plenty more opportunities but do not come with any sort of pay increase. \r\n-Workload is unsustainable and inadequate compared to pay. Old systems result in additional time and steps to get simple tasks done. The job can be extremely taxing and it is common to get the recommendation to “come into the office on the weekend” when you feel overwhelmed and share that with mgmt and others.\r\n-Goals are set by mgmt without much reasoning for how they are set. Goals do not reset quarterly and instead continue to increase, so if you are behind one month, you get even more behind the next. \r\n-Lots of uncertainty during COVID. To a degree, this is understandable given the inherent decline in the travel industry, but the problem lies in upper management continuing to share their optimism for the future of the business with no evidence to support their claims.\r\n\r\nAll in all, EF is a great place to work in your twenties, learn how to be a great salesperson/account manager, and then take that knowledge to another company that will pay you what you are worth.",
                        "consOriginal": null,
                        "countHelpful": 6,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": false,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 21799,
                            "text": "Tour Consultant"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 4,
                        "location": {
                            "__typename": "City",
                            "id": 1148170,
                            "name": "Denver, CO",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "-Travel. In a non-COVID world, you get to travel at a minimum of once a year. The longer you are there, the more you get to travel.\r\n-People. Those who work at EF are driven, diverse, excited, and friendly. They are incredible and make great teammates and friends. Everyone gets along really well.\r\n-Fun! There are lots of events put on by RED and other employees. They focus heavily on a “work hard, play hard” culture and the events are well attended and fully stocked with beer and food.\r\n-Training. Their training program for the TC role is incredible and so in depth. Even after your initial training, you continue to learn and get feedback often. Many people who leave EF say that EF gave them a great foundation to be a strong salesperson and made them a competitive hire.\r\n-Insurance. Their benefits are great.\r\n-Kate Berseth (President) is amazing. She truly cares about what Tour Consultants want and need and focuses on them as well as the overall state of the business.",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "NEGATIVE",
                        "ratingCareerOpportunities": 3.0,
                        "ratingCeo": "DISAPPROVE",
                        "ratingCompensationAndBenefits": 2.0,
                        "ratingCultureAndValues": 5,
                        "ratingDiversityAndInclusion": 3,
                        "ratingOverall": 3,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 2.0,
                        "ratingWorkLifeBalance": 1.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2021-01-03T17:46:12.633",
                        "reviewId": 40041049,
                        "summary": "Great place to work short term",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "Keep up the really wonderful correspondence and training updates. I feel very appreciated and valued. Thank you for reminding teachers of how important they are. The new pay raises help, of course, but newsletters, webinars, prompt correspondence, and good support are wonderful as well. So thanks for that.",
                        "adviceOriginal": null,
                        "cons": "There isn't a great chance for teachers to form relationships with colleagues.\r\n\r\nAs a part-time teacher, I find that I don't get scheduled many hours each week. I'm not sure why. I have to pick up most of my hours, but it works out.\r\n\r\nNo benefits (but that's to be expected in this type of position).",
                        "consOriginal": null,
                        "countHelpful": 3,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "PART_TIME",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": true,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 154446,
                            "text": "Online English Teacher"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 1,
                        "location": null,
                        "originalLanguageId": null,
                        "pros": "I'm honestly shocked to see so many negative things written by employees and former employees of Englishtown on this website. I worked for Open English before Englishtown, and I can honestly say that my work is so much easier and so much less stressful now. Englishtown is pretty much the best place you can work for as an online ESL teacher as far as I'm concerned. I was worried about student ratings and penalty fees and all of that before I started working for Englishtown, but I've been here for almost a year and have not had any issues with fees or management. In fact, the support team, while admittedly not the best, is overall very efficient. In my opinion, they really aren't harsh about class issues that may affect your pay. They are understanding and kind.\r\n\r\nThere is literally no lesson planning in this company, which is great. Even if you have a custom topic request by a private student, you can usually find a related lesson from Englishtown for them or you can just find something quick online. You don't need to go out of your way to make this huge presentation for them. Usually they just want to talk and maybe learn some new vocabulary words related to their custom topic. In fact, most private students who choose \"custom\" as their lesson topic just want to chat. It's not a big deal at all.\r\n\r\nUnlike some other online schools, you get to work with students from all over the world and not just one specific region of the world. I've learned so much from my students about their unique cultures, and it's definitely made me want to travel even more than I already do. It's always interesting to have classes with a mix of students coming from all different places and cultural backgrounds. I think the students enjoy it, too. They ask their classmates about their home countries. It helps create a really fun and inquisitive atmosphere in the classroom.\r\n\r\nGroup classes are supposed to be set at a max of six students. This is usually the case; however, I've had classes with seven a few times. Generally, I'd say classes usually have around four or five, sometimes lower. Time management is always challenging, but the lesson content is above average quality (compared to what I've seen in previous companies), which helps teachers get through most if not all of the content in 45 minutes, even with big classes.\r\n\r\nThere are usually plenty of hours on the scheduling board. Subbing and picking up hours is easy and efficient.\r\n\r\nI should have mentioned this first: US (and I think maybe worldwide, too) teachers just got a really nice pay raise. Plus, teachers get evaluated every few months (the criteria is fair and not hard to meet) to get pay raises. I started out making $11, then went to $12 with the standard pay raise implementation that happened in October 2014, and now I'm at $13.20 after a recent performance evaluation.",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "POSITIVE",
                        "ratingCareerOpportunities": 3.0,
                        "ratingCeo": null,
                        "ratingCompensationAndBenefits": 4.0,
                        "ratingCultureAndValues": 5,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 5,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 4.0,
                        "ratingWorkLifeBalance": 5.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2015-02-01T10:14:46.613",
                        "reviewId": 5826513,
                        "summary": "Things keep getting better here. LOVE it!",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": null,
                        "adviceOriginal": null,
                        "cons": "Low starting salary in this role, but there's a LOT of opportunity to work hard and make a lot of money in the role. It can be long hours, but it is really up to you.",
                        "consOriginal": null,
                        "countHelpful": 2,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": true,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 21799,
                            "text": "Tour Consultant"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 2,
                        "location": {
                            "__typename": "City",
                            "id": 1154545,
                            "name": "Cambridge, MA",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "The culture is absolutely unbeatable - great team of people working together for a common mission. The bar in the first floor helps, but it really comes down to the character of people we work with. Everyone is excited and motivated to work toward something bigger than all of us. As a TC you OWN your own business and have the potential to totally blow it up!",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "POSITIVE",
                        "ratingCareerOpportunities": 4.0,
                        "ratingCeo": "APPROVE",
                        "ratingCompensationAndBenefits": 3.0,
                        "ratingCultureAndValues": 5,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 5,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 5.0,
                        "ratingWorkLifeBalance": 4.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2017-03-10T11:38:05.187",
                        "reviewId": 14133498,
                        "summary": "Tour Consultant",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": null,
                        "adviceOriginal": null,
                        "cons": "As stated by nearly all the reviews, there is no formal hierarchy. So if you need this sort of structure in order to know where you are and where you are going, it can be tough to navigate.  You need to be empowered enough to drive your own career.",
                        "consOriginal": null,
                        "countHelpful": 2,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [
                            {
                                "__typename": "EmployerResponse",
                                "countHelpful": 0,
                                "countNotHelpful": 0,
                                "id": 1204927,
                                "languageId": "eng",
                                "originalLanguageId": null,
                                "response": "Thank you for your feedback!  You touched on many of the aspects of working at EF that I also love, including -- believe it or not -- the lack of formal hierarchy.  You hit the nail on the head when you say that our staff need to be empowered to drive their own careers.  It's up to US to empower staff and give them the resources and support to take their careers where they want.  It's responsibility we take seriously and we strive to do better at it every day.\r\n\r\n-- Mike Kaufman, Sr. Director of People Operations",
                                "responseDateTime": "2017-03-29T12:19:35.977",
                                "responseOriginal": null,
                                "translationMethod": null
                            }
                        ],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": true,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 21799,
                            "text": "Tour Consultant"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 2,
                        "location": {
                            "__typename": "City",
                            "id": 1154545,
                            "name": "Cambridge, MA",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "-You will meet and work with some incredible, passionate, and innovative people \r\n-This is a family-held, privately-owned company \r\n-You can build your personal brand and create new opportunities\r\n-It's encouraged that you do \"extracurriculars\" outside of your role\r\n-50+ years old but still functions like a start-up in many ways (Pro if you are into this)",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": null,
                        "ratingCareerOpportunities": 5.0,
                        "ratingCeo": "APPROVE",
                        "ratingCompensationAndBenefits": 4.0,
                        "ratingCultureAndValues": 5,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 5,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 5.0,
                        "ratingWorkLifeBalance": 5.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2017-03-12T12:03:07.710",
                        "reviewId": 14152170,
                        "summary": "Network-Learn-Grow",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "Provide better compensation and opportunities for promotion so you don't lose all the young talent you help cultivate. Less turnover would also yield a less chaotic environment.",
                        "adviceOriginal": null,
                        "cons": "Low pay, sometimes disorganized and chaotic environment, not much room to move up so people move out instead",
                        "consOriginal": null,
                        "countHelpful": 1,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": false,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 46912,
                            "text": "Operations Manager"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 4,
                        "location": {
                            "__typename": "City",
                            "id": 1154532,
                            "name": "Boston, MA",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "Although I quickly realized EF would not be a long-term fit for me, overall I enjoyed my 2.5 years working in Operations, and it was a good resume builder.  I was given a lot of responsibility and very quickly, got to travel to cool places, and benefitted from very good managers and, for the most part, colleagues.",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": null,
                        "ratingCareerOpportunities": 3.0,
                        "ratingCeo": null,
                        "ratingCompensationAndBenefits": 3.0,
                        "ratingCultureAndValues": 3,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 4,
                        "ratingRecommendToFriend": null,
                        "ratingSeniorLeadership": 3.0,
                        "ratingWorkLifeBalance": 4.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2017-05-30T07:46:52.473",
                        "reviewId": 15256736,
                        "summary": "Not a Bad Place to Get Your Feet Wet",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "Increase pay, pay teachers for the full class when students don't show up, and eliminate contrived language exercises that confuse students.",
                        "adviceOriginal": null,
                        "cons": "My hours have been unpredictable recently, and the class exercises can sometimes seem confusing to students. I think the company could also offer higher pay. Teachers also don't get paid for the full class when students don't show up for class although I believe the students have paid the company for the class.",
                        "consOriginal": null,
                        "countHelpful": 5,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "PART_TIME",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": true,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 154446,
                            "text": "Online English Teacher"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 2,
                        "location": {
                            "__typename": "City",
                            "id": 1153527,
                            "name": "Baltimore, MD",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "The support staff are very responsive and helpful, and the students are very motivated and respectful. Scheduling is also very flexible.",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "NEUTRAL",
                        "ratingCareerOpportunities": 3.0,
                        "ratingCeo": "NO_OPINION",
                        "ratingCompensationAndBenefits": 3.0,
                        "ratingCultureAndValues": 4,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 3,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 4.0,
                        "ratingWorkLifeBalance": 5.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2018-01-20T06:30:31.500",
                        "reviewId": 18826938,
                        "summary": "A good part-time job for some people.",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "good job at keeping your employees happy and excited about coming to work. shoutout to angie and mike for all their hard work and taking care of employees.",
                        "adviceOriginal": null,
                        "cons": "tour consultant role is sales heavy with lots of goals you have to reach. \r\nsalary is low, but it is an entry level job",
                        "consOriginal": null,
                        "countHelpful": 2,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": true,
                        "jobTitle": {
                            "__typename": "JobTitle",
                            "id": 21799,
                            "text": "Tour Consultant"
                        },
                        "languageId": "eng",
                        "lengthOfEmployment": 1,
                        "location": {
                            "__typename": "City",
                            "id": 1154532,
                            "name": "Boston, MA",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "employee experience is great, company takes care of you and provides many perks including a huge, modern building with many amenities. people are friendly and nice, culture is one of helping you reach your potential; including lots of one on ones with your managers, trainers, and anyone you want!",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "POSITIVE",
                        "ratingCareerOpportunities": 5.0,
                        "ratingCeo": "APPROVE",
                        "ratingCompensationAndBenefits": 2.0,
                        "ratingCultureAndValues": 5,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 4,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 4.0,
                        "ratingWorkLifeBalance": 3.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2019-12-09T13:42:48.067",
                        "reviewId": 30778328,
                        "summary": "Great big-company culture, fun place to work!",
                        "summaryOriginal": null,
                        "translationMethod": null
                    },
                    {
                        "__typename": "EmployerReviewRG",
                        "advice": "Promoting criteria is mostly based on sales performance, on a sales driven company is logical, but sometimes just take into consideration recent results or what people show off and not the full scope of the employee.",
                        "adviceOriginal": null,
                        "cons": "The training of the new staff is not as throughfuly as it should be.",
                        "consOriginal": null,
                        "countHelpful": 0,
                        "countNotHelpful": 0,
                        "employer": {
                            "__typename": "Employer",
                            "id": 335551,
                            "largeLogoUrl": "https://media.glassdoor.com/sqll/335551/ef-education-first-squareLogo-1731701655267.png",
                            "regularLogoUrl": "https://media.glassdoor.com/sql/335551/ef-education-first-squareLogo-1731701654832.png",
                            "shortName": "EF Education First"
                        },
                        "employerResponses": [],
                        "employmentStatus": "REGULAR",
                        "featured": false,
                        "flaggingDisabled": null,
                        "isCurrentJob": true,
                        "jobTitle": null,
                        "languageId": "eng",
                        "lengthOfEmployment": 6,
                        "location": {
                            "__typename": "City",
                            "id": 1132348,
                            "name": "New York, NY",
                            "type": "CITY"
                        },
                        "originalLanguageId": null,
                        "pros": "As an international company, you have the opportunity to work with people in all over the world, either in the office you are located or the colleagues you have to deal every day by email, skype or over the phone. There are also travelling opportunities to the different locations, depending of your role may be several times a year.",
                        "prosOriginal": null,
                        "ratingBusinessOutlook": "NEUTRAL",
                        "ratingCareerOpportunities": 3.0,
                        "ratingCeo": null,
                        "ratingCompensationAndBenefits": 3.0,
                        "ratingCultureAndValues": 4,
                        "ratingDiversityAndInclusion": 0,
                        "ratingOverall": 4,
                        "ratingRecommendToFriend": "POSITIVE",
                        "ratingSeniorLeadership": 4.0,
                        "ratingWorkLifeBalance": 3.0,
                        "relatedStructures": [],
                        "reviewDateTime": "2015-07-22T10:26:48.737",
                        "reviewId": 7314030,
                        "summary": "A great international environment to work",
                        "summaryOriginal": null,
                        "translationMethod": null
                    }
                ]
            }
        }
    }
]